---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyBoolean
source: html/8222bf92-f751-9289-0537-c86dca86c4de.htm
---
# AssetPropertyBoolean Methods

Adds a new connected asset attached to this asset property, if it allows it.